Autodesk.Revit.DB.Structure.RebarBendData.BarNominalDiameter
Defines the nominal diameter of the bar.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.BarModelDiameter
Defines the model diameter of the bar.
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.#ctor(Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Constructs a new RebarBendData using the bar type, hook types, style and orientation values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014